"""
2. Представлен список чисел.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

my_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

# 1 вариант
my_list1 = [el for num, el in enumerate(my_list) if my_list[num] > my_list[num - 1] and num != 0]
print(my_list1)

# 2 вариант
my_list2 = [el2 for el1, el2 in zip(my_list, my_list[1:]) if el2 > el1]
print(my_list2)
